app/controllers/trades_controller.rb

SELECT "meppi_trades".* FROM "meppi_trades"
SELECT COUNT(*) FROM "meppi_trades"
---
  def index
    trades = MeppiTrade.all.includes(:phone, :channel, :country)

SELECT "meppi_trades".* FROM "meppi_trades" WHERE "meppi_trades"."id" = $1 LIMIT $2  [["id", 999999], ["LIMIT", 1]]
---
  def show
    trade = MeppiTrade.find(params[:id])

INSERT INTO "meppi_trades" ("phone_id", "channel_id", "country_id", "title", "brand", "price_local", "price_usd", "currency", "stock_status", "url", "trade_type", "valid_until", "discount_percent", "discount_amount_local", "promo_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    trade = MeppiTrade.new(trade_params)

    if trade.save

SELECT "meppi_trades".* FROM "meppi_trades" WHERE "meppi_trades"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "meppi_trades" SET "title" = $1, "price_local" = $2, "updated_at" = $3 WHERE "meppi_trades"."id" = $4  [["title", "Updated Trade Title"], ["price_local", "1200.0"], ["updated_at", "2026-02-13 11:26:48.976694"], ["id", 23]]
---
  def update
    trade = MeppiTrade.find(params[:id])

    if trade.update(trade_params)

SELECT "meppi_trades".* FROM "meppi_trades" WHERE "meppi_trades"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
DELETE FROM "meppi_trades" WHERE "meppi_trades"."id" = $1  [["id", 25]]
---
  def destroy
    trade = MeppiTrade.find(params[:id])
    trade.destroy!